using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using System.Data.Entity;
/*
    умовно кажучи програма буде поділена на 3 частини
    - програмна частина, в якій буде бізнес логіка
    - віртуальна база даних - проміжна між реальною базою даних та програмою
    щоб при кожному запросі ми не зварталися до нашої бази напряму, а зверталися до нашої локальної
    як створена за допомоги Entity Framework, що дозволяє знизити нагрузку на сервер
    - власне база даних

    Підходи у створенні проекта Entity Framework:
    - DataBase first - вже є готова БД але хочемо зробити до неї програму і при під"єднанні EF до БД створюються 
    автоматично всіх сущності
    - Code first - створюємо класи по певним правилам і вже на основі класів створюються таблиці в базі даних
    - Model first - не робимо ні те ні інше, є певний редактор, в ньому накидав сущності, налаштував зв"язки
    і на їх основі генеруються наші класи й таблиці.
 */
namespace SQL_Server_Learning
{
    public class MyDbContext : DbContext
    {
        //звертаємося до нашої бази даних
        public MyDbContext() : base("DbConnectionString") //в "" ми передаємо майбутню строку підключення
        {

        }
        //створюємо сущность (клас) і називаємо так як ми хочемо щоб називалася наша таблиця - Group та Song
        //і тепер треба пов"язати ці "таблиці"

        //і останнє - вказати колекції які будемо використовувати
        public DbSet<Group> Groups { get; set; }
        public DbSet<Song> Songs { get; set; }
        //повертаємося в нашу програму...
    }

}
