/* Алгоритми сортування
 * 
 * суть - це упорядковане сортування
 * наприклад масив сум з почасовою виплатою і треба відсортувати по збільшенню зарплати
 * або масив співробітників завода
 * 
 * Види сортування:
 *  - Bubble sort (сортування позирьком) - найпростіший, це циклічне проходження масиву і за кожний прохід по масиву
 *  елементи попарно порівнюються, якщо їх порядок неправильний, відбувається обмін. І так по кругу поки 
 *  масив не буде впорядкованим
 *  - Isertion Sort (сортування вставками) - це коли елементи масива почерзі переглядаються і кожний новий елемент
 *  розміщується по порядку серед раніше впорядкованих
 *  - Merge Sort (сортування злиттям) - по принципу розділяй і володарюй, тобто масив розбивається на сортування 
 *  масивів поменьше після чого їх результат комбінується, що і призводить до вирішення первинної задачі
 *  - Quick Sort (швидке сортування) - або сортування Хоара, найбільш розповсюджений алгоритм сортування.
 *  реалізується він також по принципу розділяй і володарюй
 *  
 *  Концепція Quick Sort
 *  це 3 прості кроки:
 *  1 - це невідсортований масив
 *  2 - вибирається базовий елемент (Pivot), зазвичай останній елемент масива
 *  3 - розмістити зліва від Pivot елементи менші за Pivot, а справа - більші
 *  
 *  ці дії ми повторюємо для підмасивів знову і знову, тобто рекурсивно, поки невідсортуємо весь масив
 *  
 *  Оцінка складності сортування відбувається по двом осям (графік) де Х це горизонтально а У це вертикально
 *  У (вертикально) - кількість операцій
 *  Х (горизонтально) - розмір масива
 *  
 *  складність:
 *  О(1) (О від 1) - це простий, значення в ньому дорівнюють 10, 20, 100, 1000 і тд., на графіку тупо лінія по Х
 *  О(n log n) - середній, графік йде однаково як по Х так і по У, що зазвичай відбувається на практиці
 *  О(n2) (вквадраті) - складний, це коли в ролі Pivot вибирається максимум або мінімум вхідної послідовності
 *  (на графіку вверх по У), така ситуація малоймовірна. Такої складності бувають масиви частково відсортованими
 */

//Швидке сортування:
namespace QuickSortAlgorithm 
{ 
    class Programm
    {
        static void Main()
        {
            int[] inputArray = { 9, 12, 9, 2, 17, 1, 6 }; //вхідний масив

            int[] sortedArray = QuickSort(inputArray, 0, inputArray.Length - 1); //сортуємо від першого до останнього

            Console.WriteLine($"Sorted Array: {string.Join(", ", sortedArray)}"); //вивод на консоль

            Console.ReadLine();

        }

        private static int[] QuickSort(int[] array, int minIndex, int maxIndex)
        {
            if (minIndex >= maxIndex)
            {
                return array;
            }

            int pivotIndex = GetPivotIndex(array, minIndex, maxIndex);

            QuickSort(array, minIndex, maxIndex - 1);

            QuickSort(array, pivotIndex + 1, maxIndex);

            return array;
        }

        private static int GetPivotIndex(int[] array, int minIndex, int maxIndex)
        {
            int pivot = minIndex - 1;

            for (int i = minIndex; i <= maxIndex; i++)
            {
                if (array[i] < array[maxIndex])
                {
                    pivot++;
                    Swap(ref array[pivot], ref array[i]);
                }
            }

            pivot++;
            Swap(ref array[pivot], ref array[maxIndex]);

            return pivot;
        }

        private static void Swap(ref int leftItem, ref int rightItem)
        {
            int temp = leftItem;
            leftItem = rightItem;
            rightItem = temp;
        }
    }
}